/*******************************************************************************
 *
 * \file
 * \brief Unlimited precision integers
 *
 * Implementation of big numbers based on GMP, the GNU Multiple Precision
 * Arithmetic Library (http://gmplib.org).
 *
 * Author: Maxime Arthaud
 *
 * Contact: ikos@lists.nasa.gov
 *
 * Notices:
 *
 * Copyright (c) 2011-2019 United States Government as represented by the
 * Administrator of the National Aeronautics and Space Administration.
 * All Rights Reserved.
 *
 * Disclaimers:
 *
 * No Warranty: THE SUBJECT SOFTWARE IS PROVIDED "AS IS" WITHOUT ANY WARRANTY OF
 * ANY KIND, EITHER EXPRESSED, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED
 * TO, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL CONFORM TO SPECIFICATIONS,
 * ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,
 * OR FREEDOM FROM INFRINGEMENT, ANY WARRANTY THAT THE SUBJECT SOFTWARE WILL BE
 * ERROR FREE, OR ANY WARRANTY THAT DOCUMENTATION, IF PROVIDED, WILL CONFORM TO
 * THE SUBJECT SOFTWARE. THIS AGREEMENT DOES NOT, IN ANY MANNER, CONSTITUTE AN
 * ENDORSEMENT BY GOVERNMENT AGENCY OR ANY PRIOR RECIPIENT OF ANY RESULTS,
 * RESULTING DESIGNS, HARDWARE, SOFTWARE PRODUCTS OR ANY OTHER APPLICATIONS
 * RESULTING FROM USE OF THE SUBJECT SOFTWARE.  FURTHER, GOVERNMENT AGENCY
 * DISCLAIMS ALL WARRANTIES AND LIABILITIES REGARDING THIRD-PARTY SOFTWARE,
 * IF PRESENT IN THE ORIGINAL SOFTWARE, AND DISTRIBUTES IT "AS IS."
 *
 * Waiver and Indemnity:  RECIPIENT AGREES TO WAIVE ANY AND ALL CLAIMS AGAINST
 * THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS, AS WELL
 * AS ANY PRIOR RECIPIENT.  IF RECIPIENT'S USE OF THE SUBJECT SOFTWARE RESULTS
 * IN ANY LIABILITIES, DEMANDS, DAMAGES, EXPENSES OR LOSSES ARISING FROM SUCH
 * USE, INCLUDING ANY DAMAGES FROM PRODUCTS BASED ON, OR RESULTING FROM,
 * RECIPIENT'S USE OF THE SUBJECT SOFTWARE, RECIPIENT SHALL INDEMNIFY AND HOLD
 * HARMLESS THE UNITED STATES GOVERNMENT, ITS CONTRACTORS AND SUBCONTRACTORS,
 * AS WELL AS ANY PRIOR RECIPIENT, TO THE EXTENT PERMITTED BY LAW.
 * RECIPIENT'S SOLE REMEDY FOR ANY SUCH MATTER SHALL BE THE IMMEDIATE,
 * UNILATERAL TERMINATION OF THIS AGREEMENT.
 *
 ******************************************************************************/

#pragma once

#include <functional>
#include <iosfwd>
#include <sstream>
#include <string>
#include <type_traits>
#include <utility>

#include <gmpxx.h>

#include <boost/functional/hash.hpp>

#include <ikos/core/number/exception.hpp>
#include <ikos/core/number/supported_integral.hpp>
#include <ikos/core/support/assert.hpp>

namespace ikos {
namespace core {

namespace detail {

/// \brief Helper to handle all supported integral types with GMP
template < typename T >
struct MpzAdapter {
  T operator()(T n) { return n; }
};

/// \brief Helper to handle unsigned long long
template < bool >
struct MpzAdapterUnsignedLongLong;

template <>
struct MpzAdapterUnsignedLongLong< true > {
  unsigned long operator()(unsigned long long n) {
    return static_cast< unsigned long >(n);
  }
};

template <>
struct MpzAdapterUnsignedLongLong< false > {
  mpz_class operator()(unsigned long long n) {
    static_assert(sizeof(unsigned long long) == 8, "unexpected size");
    static_assert(sizeof(unsigned int) == 4, "unexpected size");
    mpz_class r(static_cast< unsigned int >(n >> 32U));
    r <<= 32;
    r += static_cast< unsigned int >(n & 0xFFFFFFFFU);
    return r;
  }
};

template <>
struct MpzAdapter< unsigned long long >
    : public MpzAdapterUnsignedLongLong< sizeof(unsigned long long) ==
                                         sizeof(unsigned long) > {};

/// \brief Helper to handle long long
template < bool >
struct MpzAdapterLongLong;

template <>
struct MpzAdapterLongLong< true > {
  long operator()(long long n) { return static_cast< long >(n); }
};

template <>
struct MpzAdapterLongLong< false > {
  mpz_class operator()(long long n) {
    static_assert(sizeof(long long) == 8, "unexpected size");
    static_assert(sizeof(int) == 4, "unexpected size");
    // NOLINTNEXTLINE(hicpp-signed-bitwise)
    mpz_class r(static_cast< int >(n >> 32));
    r <<= 32;
    // NOLINTNEXTLINE(hicpp-signed-bitwise)
    r += static_cast< unsigned int >(n & 0xFFFFFFFF);
    return r;
  }
};

template <>
struct MpzAdapter< long long >
    : public MpzAdapterLongLong< sizeof(long long) == sizeof(long) > {};

/// \brief Helper to check if a mpz_class fits in the given integer type
template < typename T >
struct MpzFits;

template <>
struct MpzFits< unsigned int > {
  bool operator()(const mpz_class& n) { return n.fits_uint_p(); }
};

template <>
struct MpzFits< int > {
  bool operator()(const mpz_class& n) { return n.fits_sint_p(); }
};

template <>
struct MpzFits< unsigned long > {
  bool operator()(const mpz_class& n) { return n.fits_ulong_p(); }
};

template <>
struct MpzFits< long > {
  bool operator()(const mpz_class& n) { return n.fits_slong_p(); }
};

/// \brief Helper to handle unsigned long long
template < bool >
struct MpzFitsUnsignedLongLong;

template <>
struct MpzFitsUnsignedLongLong< true > {
  bool operator()(const mpz_class& n) { return n.fits_ulong_p(); }
};

template <>
struct MpzFitsUnsignedLongLong< false > {
  bool operator()(const mpz_class& n) {
    static_assert(sizeof(unsigned long long) == 8, "unexpected size");
    static_assert(sizeof(unsigned int) == 4, "unexpected size");
    return mpz_sgn(n.get_mpz_t()) >= 0 &&
           mpz_sizeinbase(n.get_mpz_t(), 2) <= 64;
  }
};

template <>
struct MpzFits< unsigned long long >
    : public MpzFitsUnsignedLongLong< sizeof(unsigned long long) ==
                                      sizeof(unsigned long) > {};

/// \brief Helper to handle long long
template < bool >
struct MpzFitsLongLong;

template <>
struct MpzFitsLongLong< true > {
  bool operator()(const mpz_class& n) { return n.fits_slong_p(); }
};

template <>
struct MpzFitsLongLong< false > {
  bool operator()(const mpz_class& n) {
    static_assert(sizeof(long long) == 8, "unexpected size");
    static_assert(sizeof(int) == 4, "unexpected size");
    if (mpz_sgn(n.get_mpz_t()) >= 0) {
      return mpz_sizeinbase(n.get_mpz_t(), 2) <= 63;
    } else {
      mpz_class m(-n - 1);
      return mpz_sizeinbase(m.get_mpz_t(), 2) <= 63;
    }
  }
};

template <>
struct MpzFits< long long >
    : public MpzFitsLongLong< sizeof(long long) == sizeof(long) > {};

/// \brief Helper to convert a mpz_class to the given integer type
template < typename T >
struct MpzTo;

template <>
struct MpzTo< unsigned int > {
  unsigned int operator()(const mpz_class& n) {
    return static_cast< unsigned int >(n.get_ui());
  }
};

template <>
struct MpzTo< int > {
  int operator()(const mpz_class& n) { return static_cast< int >(n.get_si()); }
};

template <>
struct MpzTo< unsigned long > {
  unsigned long operator()(const mpz_class& n) { return n.get_ui(); }
};

template <>
struct MpzTo< long > {
  long operator()(const mpz_class& n) { return n.get_si(); }
};

/// \brief Helper to handle unsigned long long
template < bool >
struct MpzToUnsignedLongLong;

template <>
struct MpzToUnsignedLongLong< true > {
  unsigned long long operator()(const mpz_class& n) {
    return static_cast< unsigned long long >(n.get_ui());
  }
};

template <>
struct MpzToUnsignedLongLong< false > {
  unsigned long long operator()(const mpz_class& n) {
    static_assert(sizeof(unsigned long long) == 8, "unexpected size");
    static_assert(sizeof(unsigned int) == 4, "unexpected size");
    auto hi = static_cast< unsigned long long >(mpz_class(n >> 32).get_ui());
    auto lo =
        static_cast< unsigned long long >(mpz_class(n & 0xFFFFFFFF).get_ui());
    return (hi << 32U) + lo;
  }
};

template <>
struct MpzTo< unsigned long long >
    : public MpzToUnsignedLongLong< sizeof(unsigned long long) ==
                                    sizeof(unsigned long) > {};

/// \brief Helper to handle long long
template < bool >
struct MpzToLongLong;

template <>
struct MpzToLongLong< true > {
  long long operator()(const mpz_class& n) {
    return static_cast< long long >(n.get_si());
  }
};

template <>
struct MpzToLongLong< false > {
  long long operator()(const mpz_class& n) {
    static_assert(sizeof(long long) == 8, "unexpected size");
    static_assert(sizeof(int) == 4, "unexpected size");
    auto hi = static_cast< long long >(mpz_class(n >> 32).get_si());
    auto lo = static_cast< long long >(mpz_class(n & 0xFFFFFFFF).get_ui());
    // NOLINTNEXTLINE(hicpp-signed-bitwise)
    return (hi << 32) + lo;
  }
};

template <>
struct MpzTo< long long >
    : public MpzToLongLong< sizeof(long long) == sizeof(long) > {};

} // end namespace detail

/// \brief Class for unlimited precision integers
class ZNumber {
private:
  mpz_class _n;

public:
  /// \brief Create a ZNumber from a string representation
  ///
  /// Interpret the null-terminated string `str` in the given base.
  ///
  /// If the string contains unsuitable characters for the given base, throw
  /// an exception NumberError.
  ///
  /// The base may vary from 2 to 36.
  static ZNumber from_string(const char* str, int base = 10) {
    try {
      return ZNumber(mpz_class(str, base));
    } catch (std::invalid_argument&) {
      std::ostringstream buf;
